<?php

namespace Ilslo\Oop;

// TODO: 5. Якщо дуже просто, то інтерфейси це список методів, які мають бути реалізовані в класі, який імплементує
// TODO: 5.1 Інтерфейси, можуть наслідувати інтерфейси, за допомогою ключового слова extends
// цей інтерфейс
// TODO: 5.2 Інтерфейси, не можуть містити приватні/protected методи і властивості
// TODO: 5.3 Різниця від абстракцій в тому, що класи можуть імплементувати багато інтерфейсів, а абстрактний клас
// може бути наслідуваний один
// Також, різниця в тому, що абстрактні класи, можуть мати методи з мінімальною реалізацією
interface WorkerInterface
{
  public function work();
}